---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SketchPlane
source: html/2c590f87-babc-517b-409e-58dd78f25c41.htm
---
# SketchPlane Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.